# GetVertexConnectionMap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Blend..::..GetVertexConnectionMap Method
Blend Class See Also
---
Gets the mapping between the vertices in the top and bottom profiles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VertexIndexPairArray GetVertexConnectionMap()
```

Visual Basic
---
```text
Public Function GetVertexConnectionMap As VertexIndexPairArray
```

Visual C++
---
```text
public:
VertexIndexPairArray^ GetVertexConnectionMap()
```

# Remarks
Each vertex refers to the start point of the curve from the top and bottom profiles.
# See Also
Blend Class
Autodesk.Revit.DB Namespace